package ch11;

/**
 * 컬렉션이란? = 물건들을 모아놓은 것
 * 여러 객체(데이터)를 모아 놓은 것을 의미
 * 라이브러리란?
 * 다른 사람이 미리 만들어 놓은 기능을 모아놓은 것
 * Ex) Math, DecimalFormat, SimpleDateFormat 등의 자바 API가 제공하는 기능들
 * 프레임웍이란?
 * 표준화, 정형화된 체계적인 프로그래밍 방식
 * 라이브러리 + 프로그래밍 방법까지 제한 = 기능 뿐만 아니라 프로그래밍 방식까지 정해놓음
 * 컬렉션 프레임웍이란? = 여러 객체 + 틀 작업 => 다수의 데이터 다루기
 * 컬렉션(다수의 객체)을 다루기 위한 표준화된 프로그래밍 방식
 * 컬렉션을 쉽고 편리하게 다룰 수 있는(저장, 삭제, 검색, 정렬) 다양한 클래스를 제공
 * java.util패키지에 포함. JDK 1.2부터 제공E
 * 컬렉션 클래스란?
 * 다수의 데이터를 저장할 수 있는 클래스(Ex, Vector, ArrayList, HashSet)
 */

/**
 * 컬렉션 프레임웍의 핵심 인터페이스
 * 1. List = 순서 O, 중복 O
 * 2. Set = 순서 X, 중복 X
 * 3. Map = 순서 X, 키중복 X, 값중복 O
 * 키와 값의 쌍으로 이루어진 데이터(Ex, 지역번호 02: 서울)
 */

public class Ex11_1_1_Collections {
}
